<!doctype html>
<html>
    <head>
        <title>PHP-Kontrollstrukturen</title>
        <link rel="stylesheet" href="main.css">
    </head>
    <body>
        <div id="main">
            <header>
                <h1>PHP-Kontrollstrukturen</h1>
            </header>
            <section id="main_section">
                <p>Wie jede Programmiersprache besteht auch PHP aus vielen verschiedenen Kontrollstrukturen, die man bestenfalls alle kennen sollte. Deswegen werden auf dieser Webseite als Einstieg die wichtigsten vorgestellt. Dabei ist wichtig anzumerken, dass uns leider das Vorstellen aller Kontrollstrukturen nicht m&ouml;glich ist, weswegen wir hier nur f&uuml;r die weiteren Kontrollstrukturen auf eine andere Webseite verweisen, die sich genauer mit dem Thema besch&auml;ftigt.</p>
                <section>
                    <h3>If/If-else</h3>
                    <p>Wenn man auch nur einigerma&szlig;en komplexe Webseite erstellen will, wrid man feststellen, dass es in den seltensten F&auml;llen sinnvoll ist, dass der gesamte Code ungeachtet bestimmter Bedingungen komplett von oben nach unten ausgef&uuml;hrt wird. Um mit solch Bedingungen umzugehen, wurde in PHP und auch in fast allen anderen Programmiersprachen die M&ouml;glichkeit einprogrammiert, bestimmte Code-Zeilen mithilfe der if(-else) Kontrollstruktur nur unter bestimmten Bedingungen auszuf&uuml;hren. Die Syntax dieser Struktur ist sehr einfach und &auml;hnelt anderen Programmiersprachen sehr stark. Sie f&auml;ngt mit &bdquo;if&ldquo; an, worauf in Klammern die Bedingung folgt, die in einfacher Boolescher Algebra in der PHP-spezifischen Schreibweise geschrieben ist. Danach schreibt man nur noch in geschweiften Klammern, den f&uuml;r den Fall, dass die Bedingung wahr ist, auzuf&uuml;hrenden Code. Wahlweise kann man noch ein &bdquo;else&ldquo; mit dem Code in geschweiften Klammern, der ausgef&uuml;hrt werden soll, falls die Bedingung nicht zutrifft. Dazu folgendes Beispiel:</p>
                    <iframe src="if.html"></iframe>
                    <p>In diesem Beispiel geht es um ein Gewinnspiel, das immer am 1. Tag eines Monats stattfindet. Als erstes wird geguckt, ob heute der Tag, ist an dem es stattfindet. Wenn es nicht stattfindet, gibt es zwei M&ouml;glichkeiten: Wenn es der 30. oder der 31. des Monats ist, wird einem gesagt, dass es nicht mehr lange bis zum n&auml;chsten Gewinnspiel dauert. Sonst wird einem mitgeteilt, dass es noch ein Bisschen bis zum n&auml;chsten Gewinnspiel dauert. Wenn man genau guckt f&auml;llt auch auf, dass eine alternative Syntax erw&auml;hnt wird. Damit keine Verwirrungen entstehen werden hier nochmal die verschiedenen Arten der Syntax &uuml;bersichtlich gezeigt:<br><pre>if (Bedingung){<br>    Befehle(, die ausgef&uuml;hrt werden, wenn die Bedingung stimmen, mit Semikolon jeweils am Ende)<br>} else {<br>    if(andere Bedingungen){<br>        Befehle(, die ausgef&uuml;hrt werden, wenn die andere Bedingung stimmt und die erste nicht, mit Semikolon am Ende)<br>    } else {<br>        Befehle(, die ausgef&uuml;hrt werden, wenn beide Bedingungen nicht zustimmen, mit Semikolon am Ende)<br>    }<br>}</pre><br><p>Zus&auml;tzlich gibt es noch mehrere M&ouml;glichkeiten, die Syntax zu vereinfachen. Ganz vereinfacht s&auml;he es so aus:</p><br><pre>if (Bedingung):<br>    Befehle(, die ausgef&uuml;hrt werden, wenn die Bedingung zustimmen, mit Semikolon jeweils am Ende)<br>elseif (andere Bedingungen):<br>    Befehle(, die ausgef&uuml;hrt werden, wenn die andere Bedingung stimmt und die erste nicht, mit Semikolon am Ende)<br>else:<br>    Befehle(, die ausgef&uuml;hrt werden, wenn beide Bedingungen nicht zustimmen, mit Semikolon am Ende)<br>endif;</pre></p>
                </section>
                <section>
                    <h3>Der While-Loop</h3>
                    <p>Irgendwann, wenn man von dem blo&szlig;en Arbeiten mit Bedingungen genug hat und sich an komplexere Projekte wagt, hat man das Probleme, dass man bestimmten Code leicht ver&auml;ndert oder gleich wiederholen will, um dies zu realisieren, k&ouml;nnte man theoretisch in den meisten F&auml;llen einfach den Code kopieren. Dies ist allerdings suboptimal, da man dann Probleme hat, wenn man beispielsweise in jeder Wiederholung etwas &auml;ndern will oder die Datei irgendwo hochladen will und dann Probleme mit der Dateigr&ouml;&szlig;e hat oder wenn man die Anzahl an Wiederholungen von irgendetwas anderem abh&auml;ngig machen will. Zu Behebung dieses Problems gibt es in PHP und vielen anderen Programmiersprachen die Kontrollstruktur des Loops(Wiederholung). Mit zwei davon wird sich auf dieser Seite besch&auml;ftigt. Die einfachste Form des Loops ist der while-Loop, der einen in geschweiften Klammern angegebenen Code ausf&uuml;hrt solange eine davor in Klammern nach while angegebene Bedingungm erf&uuml; ist. Wenn man den Code einmal ausf&uuml;hren will, selbst wenn die Bedingung nicht stimmt kann man den Do-while-Loop verwenden, der sich von dem While-Loop nur dadurch unterscheidet, dass man anstelle des while am Anfang mit einer Bedingung nur do schreibt und while und die Bedingung nach den Code setzt. Dazu folgendes Beispiel:</p>
                    <iframe src="do-while.html"></iframe>
                    <p>In diesem Beispiel geht es darum tausendmal eine Zahl auszugeben, die bei jeder Wiederholung um eins gr&ouml;&szlig;er wird. Hierbei ist es nicht m&ouml;glich den Code zu vereinfachen, da dies von dem Do-while-Loop nicht unterst&uuml;tzt wird. Allerdings kann man den While-Loop auch vereinfachen und deswegen wird im Folgenden nocheinmal die Syntax gezeigt:<br>Zuerst von dem Do-While-Loop:<br><pre>do {<br>    Code(, der ausgef&uuml;hrt wird, solange die gleich geschriebene Bedingung stimmt, mit Semikolon am Ende)<br>} while (Bedingung);<br>Nun der nicht vereinfachten While-Loop:<br>while (Bedingung) {<br>    Code(, der ausgef&uuml;hrt wird, solange die Bedingung stimmt, mit Semikolon am Ende)<br>}<br>Nun vereinfacht:<br>while (Bedingung):<br>    Code(, der ausgef&uuml;hrt wird, solange die Bedingung stimmt, mit Semikolon am Ende)<br>endwhile;<br>Hierbei ist allerdings zu sagen, dass der vereinfachte Code nicht unbedingt einfacher ist.</pre></p>
                </section>
                <section>
                    <h3>Der For-Loop</h3>
                    <p>Die Art, auf die der Loop eben geschrieben wurde, ist etwas umst&auml;ndlich. Genau deswegen gibt es den sogenannten For-Loop, der fast keinen Unterschied gegen&uuml;ber dem While-Loop bis auf den Vorteil, dass man vor die Bedingung, durch ein Semikolon davon abgetrennt, Code schreiben kann, der ausgef&uuml;hrt wird, bevor der Code, der in der geschweiften Klammer steht, ausgef&uuml;hrt wurde, und nach die Bedingung, davon auch mit einem Semikolon abgetrennt, Code, der nach jeder Wiederholung ausgef&uuml;hrt wird, schreiben kann, hat. Dazu folgendes Beispiel:</p>
                    <iframe src="for.html"></iframe>
                    <p>Dieses Beispiel unterscheidet sich nur sehr leicht von dem vorherigen, bis auf den Unterschied, dass es zwei Zeilen k&uuml;rzer ist und trotzdem noch leicht zu verstehen. Auch bei dem For-Loop gibt es wieder eine vereinfachte Syntax, die jetzt hier zusammen mit der normalen nocheinmal neu aufgef&uuml;hrt wird:<br>Zuerst die normale Version:<br><pre>for (Code, der als allererstes ausgef&uuml;hrt wird; Bedingung; Code, der nach jeder Wiederholung durchgef&uuml;hrt wird) {<br>    Code(, aus dem jede Wiederholung vor allem besteht, mit Semikolon am Ende)<br>}<br>Nun die vereinfachte Syntax:<br>for (Code, der als allererstes ausgef&uuml;hrt wird; Bedingung; Code, der nach jeder Wiederholung durchgef&uuml;hrt wird):<br>    Code(, aus dem jede Wiederholung vor allem besteht, mit Semikolon am Ende)<br>endfor;<br></pre><p>Auch hier kann man sagen, dass die vereinfachte Version nicht sehr viel einfacher als die normale ist.</p></p>
                </section>
                <p>Die hier angewandten Einr&uuml;ckungen sind nicht f&uuml;r das Funktionieren des Codes notwendig, sie erleichtern aber das Lesen und Verstehen des Codes immens. Wir haben den Code so einger&uuml;ckt, wie es weitl&auml;ufig &uuml;blich ist.</p>
            </section>
        </div>
    </body>
</html>
